
Функция ПолучитьМаркиGet(Запрос)
	Ответ = Новый HTTPСервисОтвет(200); 
	ИДДок = Запрос.ПараметрыURL.Получить("ИДДок");
     
    Если ИДДок = Неопределено Тогда 
        Ответ = Новый HTTPСервисОтвет(400);
        Ответ.УстановитьТелоИзСтроки("Не задан ГУИД документа");
        Ответ.Заголовки.Вставить("Content-Type","application/json");
        Возврат Ответ;
	КонецЕсли; 
	
    СтрокаJSON = СписокМарок(ИДДок);
    Ответ.УстановитьТелоИзСтроки(СтрокаJSON); 
    Ответ.Заголовки.Вставить("Content-Type","application/json");
    Возврат Ответ;
КонецФункции       

Функция СписокМарок(ИДДок) Экспорт
     
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ЕСТЬNULL(МаркиДокументаЕРПНВД_ШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода, """") КАК Марка,
    |	ЕСТЬNULL(МаркиДокументаЕРПНВД_ШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура.ИдЕРП, """") КАК НоменклатураИдЕРП
    |ИЗ
    |	Документ.ДокументЕРП.НВД_ШтрихкодыУпаковок КАК МаркиДокументаЕРПНВД_ШтрихкодыУпаковок
    |ГДЕ
    |	МаркиДокументаЕРПНВД_ШтрихкодыУпаковок.Ссылка.ИдЕРП = &ИдЕРП";
     
	Запрос.Параметры.Вставить("ИдЕРП",ИДДок);
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Массив = Новый Массив;
    Структура = Новый Структура("Марка, ИдНоменклатура");
	Пока Выборка.Следующий() Цикл       
    	Структура = Новый Структура("Марка, ИдНоменклатура");
        Структура.Марка = Выборка.Марка; 
		Структура.ИдНоменклатура = Выборка.НоменклатураИдЕРП;
        Массив.Добавить(Структура);
    КонецЦикла;
     
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Массив);
     
    СтрокаJSON = ЗаписьJSON.Закрыть();
    Возврат СтрокаJSON;
     
КонецФункции



