Перем МодульОбъекта;

&НаСервере
Функция МодульОбъекта()

    Если МодульОбъекта = Неопределено Тогда

        МодульОбъекта = РеквизитФормыВЗначение("Объект");

    КонецЕсли;

    Возврат МодульОбъекта;

КонецФункции


&НаСервере
Процедура ВыгрузкаНоменклатурыНаСервере()
	МодульОбъекта(). ВыгрузитьНоменклатуру(2);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаНоменклатуры(Команда)
	ВыгрузкаНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбменWNSНаСервере()
	МодульОбъекта().ВыполнитьОбменWMS(); 
КонецПроцедуры

&НаКлиенте
Процедура ОбменWNS(Команда)
	ОбменWNSНаСервере();
КонецПроцедуры
