#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Вызов http-сервисов").ВТранзакции()
   	.ДобавитьТест("ТестЗапросМарокПоИДПозитив", "", "Позитив") 
	.ДобавитьТест("ТестЗапросМарокПоИДНегатив", "", "Негатив")

	;

КонецПроцедуры

Процедура ТестЗапросМарокПоИДПозитив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	РезультатФункции = ОбменHTTPСевис.ПолучитьМарки(ПолучитьДокумент(), "hs", "");
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("Массив")
		.ИмеетДлинуБольше(0, "Проверка, что количество элементов соответствия больше 0")
		;
		
КонецПроцедуры  
	
Процедура ТестЗапросМарокПоИДНегатив() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	РезультатФункции = ОбменHTTPСевис.ПолучитьМарки("12345", "hs", "");
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(РезультатФункции)
		.ИмеетТип("Массив")
		.ИмеетДлину(0, "Проверка на количество полей массива равное 0")
		;
		
КонецПроцедуры 
	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьДокумент()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриходныйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходныйОрдер КАК ПриходныйОрдер
		|ГДЕ
		|	ПриходныйОрдер.Дата < &Дата1";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат   Строка(ВыборкаДетальныеЗаписи.Ссылка.уникальныйИдентификатор());
	КонецЦикла;
	
	Возврат "";

	
КонецФункции

#КонецОбласти