#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Обработка обмен wms").ВТранзакции()
   	.ДобавитьТест("ТестВыполнитьОбменWMS", "", "Позитив")
	;

КонецПроцедуры

Процедура ТестВыполнитьОбменWMS() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	обр = обработки.ОбменWMS.создать(); 
	обр.ВыполнитьОбменWMS();

	
КонецПроцедуры    



#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти