Перем МодульОбъекта;

&НаСервере
Функция МодульОбъекта()

    Если МодульОбъекта = Неопределено Тогда

        МодульОбъекта = РеквизитФормыВЗначение("Объект");

    КонецЕсли;

    Возврат МодульОбъекта;   
	
КонецФункции

&НаСервере
Процедура ИнициализацияНаСервере()
	МодульОбъекта().ИнициализацияМодуля();
КонецПроцедуры

&НаКлиенте
Процедура Инициализация(Команда)
	ИнициализацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДемоНаСервере()    
 МодульОбъекта().ИнициализацияМодуляЗапись();
 МодульОбъекта().ЗагрузитьDemoJSONНажатие();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДемо(Команда)
	ЗагрузитьДемоНаСервере();
КонецПроцедуры

&НаСервере
Функция ОтправитьНаСервере()  
 МодульОбъекта().ИнициализацияМодуляЗапись();    
 МодульОбъекта().ЗагрузитьDemoJSONНажатие();
 Результат = МодульОбъекта().Отправить_ЗаписьНажатие();
 Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	Результат = ОтправитьНаСервере(); 
	Если Не Результат.булУспешно Тогда 
		Сообщить(Результат.стрОписаниеОшибки);	
	Иначе 
	Сообщить("Все сообщения доставлены");
	ТекДок = Новый ТекстовыйДокумент();
	ТекДок.УстановитьТекст(Результат.стрОтчетОДоставке);	
	ТекДок.Показать("Отчет о доставке");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОтправитьСллбщениеНаСервере()
	мДанныеНаЗапись = Новый Массив();
	мЗаголовки = Новый Массив();
	мЗаголовки.Добавить(Новый Структура("Заголовок1", "Значение" + 1));
	мЗаголовки.Добавить(Новый Структура("Заголовок2", "Значение" + 2));
	стрСообщение = "Тестовое сообщение " + 1;
	мДанныеНаЗапись.Добавить(Новый Структура("Key, Value, Headers", Строка(Новый УникальныйИдентификатор()), стрСообщение, мЗаголовки));
	МодульОбъекта().ИнициализацияМодуляЗапись();    
    МодульОбъекта().ОтправитьСообщение(мДанныеНаЗапись);
    Результат = МодульОбъекта().Отправить_ЗаписьНажатие();
    Возврат результат;
КонецФункции

&НаКлиенте
Процедура ОтправитьСллбщение(Команда)
	Результат = ОтправитьСллбщениеНаСервере();       
		Если Не Результат.булУспешно Тогда 
		Сообщить(Результат.стрОписаниеОшибки);	
	Иначе 
	Сообщить("Все сообщения доставлены");
	ТекДок = Новый ТекстовыйДокумент();
	ТекДок.УстановитьТекст(Результат.стрОтчетОДоставке);	
	ТекДок.Показать("Отчет о доставке");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()  
	 МодульОбъекта().ИнициализацияМодуляЧтение();   
	 Результат = МодульОбъекта().ПрочитатьJSON_ЧтениеНажатие();   
	 ЗначениеВРеквизитФормы(МодульОбъекта(), "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();  
	Этаформа.ОбновитьОтображениеДанных();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьМаркиНаСервере()
 МодульОбъекта().ЗагрузитьМарки();   
 ЗначениеВРеквизитФормы(МодульОбъекта(), "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМарки(Команда)
	ЗагрузитьМаркиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНоменклатуруНаСервере()
 МодульОбъекта().ЗагрузитьНоменклатуру();   
 ЗначениеВРеквизитФормы(МодульОбъекта(), "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	ЗагрузитьНоменклатуруНаСервере();
КонецПроцедуры
