Перем МодульОбъекта;

&НаСервере
Функция МодульОбъекта()

    Если МодульОбъекта = Неопределено Тогда

        МодульОбъекта = РеквизитФормыВЗначение("Объект");

    КонецЕсли;

    Возврат МодульОбъекта;

КонецФункции


&НаСервере
Процедура ВыгрузкаНоменклатурыНаСервере()
	МодульОбъекта(). ВыгрузитьНоменклатуру(2);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаНоменклатуры(Команда)
	ВыгрузкаНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбменWNSНаСервере()
	МодульОбъекта().ВыполнитьОбменWMS();  
	ЗначениеВРеквизитФормы(МодульОбъекта(), "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбменWNS(Команда)
	ОбменWNSНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодготовитьКлючевуюОперациюНаСервере()
КлючевыеОперации = Новый Массив();
	
	КлючеваяОперация1 = Новый Структура("ИмяКлючевойОперации, ЦелевоеВремя");
	КлючеваяОперация1.ИмяКлючевойОперации = "Получение марок через http-сервис";
	КлючеваяОперация1.ЦелевоеВремя = 0.5;	
	
	//КлючеваяОперация2 = Новый Структура("ИмяКлючевойОперации, ЦелевоеВремя");
	//КлючеваяОперация2.ИмяКлючевойОперации = "ТестоваяКлючеваяОперация2";
	//КлючеваяОперация2.ЦелевоеВремя = 1;	

	
	КлючевыеОперации.Добавить(КлючеваяОперация1);
	//КлючевыеОперации.Добавить(КлючеваяОперация2);

	// Записи в справочник "Ключевые операции"
	ОценкаПроизводительности.СоздатьКлючевыеОперации(КлючевыеОперации);
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьКлючевуюОперацию(Команда)
	ПодготовитьКлючевуюОперациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрзкаВсейНоменклатурыНаСервере()     
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	МасН = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	обр = обработки.РаботаСKafkaЧерезВК.Создать();
	обр.ВыгрузитьНоменклатуру(МасН);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрзкаВсейНоменклатуры(Команда)
	ВыгрзкаВсейНоменклатурыНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоманадНаЗагрузкуМарокНаСервере()
	ОбменHTTPСевис.ЗагрузитьМарки( "hs", "");
КонецПроцедуры

&НаКлиенте
Процедура КоманадНаЗагрузкуМарок(Команда)
	КоманадНаЗагрузкуМарокНаСервере();
КонецПроцедуры
