
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТЗ = ОбменHTTPСевис.ПолучитьМарки(Строка(ОБЪЕКТ.ССЫЛКА.УникальныйИдентификатор()), "hs", "");
	Если ТЗ <> Неопределено Тогда
		Марки.Очистить();
		Для каждого стр из ТЗ Цикл
			стр1 = Марки.Добавить();
			стр1.Марка = стр.Марка;   
			Если стр.ИдНоменклатура <> "" Тогда
				стр1.Номенклатура = справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(стр.ИдНоменклатура));
			КонецЕсли;
		КонецЦикла;     
	КонецЕсли;
КонецПроцедуры
