  Функция ПолучитьМарки(ИДОК, Логин = Неопределено, Пароль = Неопределено) Экспорт
	
	Попытка
		// Формируем URL
		АдресСервиса = "/markirovka/hs/Mark/GetMark/" + ИДОК;
		
		// Создаем HTTP-соединение с аутентификацией
		HTTPСоединение = Новый HTTPСоединение("localhost", 80, логин, пароль);
		
	
		// Создаем запрос
		Запрос = Новый HTTPЗапрос(АдресСервиса);
		//Запрос.УстановитьЗаголовок("Content-Type", "application/json");
		
		// Выполняем запрос
		Ответ = HTTPСоединение.Получить(Запрос);
		
		// Проверяем успешность запроса
		Если Ответ.КодСостояния = 401 Тогда
			ВызватьИсключение "Ошибка аутентификации: неверный логин или пароль";
		ИначеЕсли Ответ.КодСостояния <> 200 Тогда
			ВызватьИсключение "Ошибка HTTP: " + Ответ.КодСостояния + " - " + Ответ.ПолучитьТелоКакСтроку();
		КонецЕсли;   
		
		
		Поток = Ответ.ПолучитьТелоКакПоток(); 
		// Создаем объект ЧтениеJSON 
		ЧтениеJSON = Новый ЧтениеJSON; 
		// Открываем поток для чтения JSON 
		ЧтениеJSON.ОткрытьПоток(Поток); 
		// Читаем JSON и преобразуем в массив 
		МассивМарок = ПрочитатьJSON(ЧтениеJSON); 
		// Закрываем ЧтениеJSON ЧтениеJSON.Закрыть();
		// Закрываем поток 
		Поток.Закрыть(); 
		// Теперь в МассивТоваров у вас массив с данными о товарах 
		
		Возврат МассивМарок;
		
		//
		//
		//// Получаем тело ответа
		//ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		//
		//// Парсим JSON ответ
		//ЧтениеJSON = Новый ЧтениеJSON;
		//ЧтениеJSON.Поток = Новый ПотокВПамяти;
		//ЧтениеJSON.Поток.Записать(ТелоОтвета);
		//ЧтениеJSON.Поток.Перейти(0, ПозицияПотока.Начало);
		//
		//Данные = ПрочитатьJSON(ЧтениеJSON);
		//
		//// Преобразуем в таблицу значений
		//ТЗ = ПреобразоватьJSONВТаблицу(Данные);
		//
		//Возврат ТЗ;
		
	Исключение
		Сообщить("Ошибка при получении данных: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции       

 Функция ЗагрузитьМарки(Логин = Неопределено, Пароль = Неопределено) Экспорт
	
	Попытка
		// Формируем URL
		АдресСервиса = "/markirovka/hs/Mark/putMark";
		
		// Создаем HTTP-соединение с аутентификацией
		HTTPСоединение = Новый HTTPСоединение("localhost", 80, логин, пароль);
		
		// Создаем запрос
		Запрос = Новый HTTPЗапрос(АдресСервиса);
		//Запрос.УстановитьЗаголовок("Content-Type", "application/json");
		
		// Выполняем запрос
		Ответ = HTTPСоединение.Получить(Запрос);
		
		// Проверяем успешность запроса
		Если Ответ.КодСостояния = 401 Тогда
			ВызватьИсключение "Ошибка аутентификации: неверный логин или пароль";
		ИначеЕсли Ответ.КодСостояния <> 200 Тогда
			ВызватьИсключение "Ошибка HTTP: " + Ответ.КодСостояния + " - " + Ответ.ПолучитьТелоКакСтроку();
		КонецЕсли;   
		
	Исключение
		Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции  

Функция ПреобразоватьJSONВТаблицу(ДанныеJSON)
	
	ТЗ = Новый ТаблицаЗначений;
	
	Если ТипЗнч(ДанныеJSON) = Тип("Массив") И ДанныеJSON.Количество() > 0 Тогда
		
		ПервыйЭлемент = ДанныеJSON[0];
		Если ТипЗнч(ПервыйЭлемент) = Тип("Структура") Тогда
			Для Каждого КлючЗначение Из ПервыйЭлемент Цикл
				ТЗ.Колонки.Добавить(КлючЗначение.Ключ);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Элемент Из ДанныеJSON Цикл
			НоваяСтрока = ТЗ.Добавить();
			Для Каждого КлючЗначение Из Элемент Цикл
				НоваяСтрока[КлючЗначение.Ключ] = КлючЗначение.Значение;
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеJSON) = Тип("Структура") Тогда
		Для Каждого КлючЗначение Из ДанныеJSON Цикл
			ТЗ.Колонки.Добавить(КлючЗначение.Ключ);
		КонецЦикла;
		
		НоваяСтрока = ТЗ.Добавить();
		Для Каждого КлючЗначение Из ДанныеJSON Цикл
			НоваяСтрока[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТЗ;
	
КонецФункции

