#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Обработка работа с Кафкой").ВТранзакции()
   	.ДобавитьТест("ТестЗагрузитьНоменклатура", "", "Позитив")
	.ДобавитьТест("ТестЗагрузитьМарки", "", "Позитив")
	;

КонецПроцедуры

Процедура ТестЗагрузитьНоменклатура() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	обр = обработки.РаботаСKafkaЧерезВК.создать(); 
	обр.ЗагрузитьНоменклатуру();

	
КонецПроцедуры    

Процедура ТестЗагрузитьМарки() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	
	// 2. Выполнение функции.
	обр = обработки.РаботаСKafkaЧерезВК.создать(); 
	обр.ЗагрузитьМарки();

	
КонецПроцедуры 


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти